# GetFabricationConnectorDomain Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetFabricationConnectorDomain Method
FabricationConfiguration Class See Also
---
Gets the fabrication connector domain from its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ConnectorDomainType GetFabricationConnectorDomain(
	int fabricationConnectorId
)
```

Visual Basic
---
```text
Public Function GetFabricationConnectorDomain ( _
	fabricationConnectorId As Integer _
) As ConnectorDomainType
```

Visual C++
---
```text
public:
ConnectorDomainType GetFabricationConnectorDomain(
	int fabricationConnectorId
)
```

# ### Parameters
fabricationConnectorId
    Type: System..::..Int32 The fabrication connector identifier.
# ### Return Value
The fabrication connector's domain.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace